In [64]:
import pandas as pd
import numpy as np

In [65]:
univ_df = pd.read_csv( "expanded.csv" )
univ_df

,Unnamed: 0,Gender,EthnicGroup,ParentEduc,LunchType,TestPrep,ParentMaritalStatus,PracticeSport,IsFirstChild,NrSiblings,TransportMeans,WklyStudyHours,MathScore,ReadingScore,WritingScore
0,0,female,NaN,bachelor's degree,standard,none,married,regularly,yes,3.0,school_bus,< 5,71,71,74
1,1,female,group C,some college,standard,NaN,married,sometimes,yes,0.0,NaN,5 - 10,69,90,88
2,2,female,group B,master's degree,standard,none,single,sometimes,yes,4.0,school_bus,< 5,87,93,91
3,3,male,group A,associate's degree,free/reduced,none,married,never,no,1.0,NaN,5 - 10,45,56,42
4,4,male,group C,some college,standard,none,married,sometimes,yes,0.0,school_bus,5 - 10,76,78,75
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
30636,816,female,group D,high school,standard,none,single,sometimes,no,2.0,school_bus,5 - 10,59,61,65
30637,890,male,group E,high school,standard,none,single,regularly,no,1.0,private,5 - 10,58,53,51
30638,911,female,NaN,high school,free/reduced,completed,married,sometimes,no,1.0,private,5 - 10,61,70,67
30639,934,female,group D,associate's degree,standard,completed,married,regularly,no,3.0,school_bus,5 - 10,82,90,93
30640,960,male,group B,some college,standard,none,married,never,no,1.0,school_bus,5 - 10,64,60,58

In [66]:
#2. Выполпить преобработку данных
#1. Числовые переменные пометить меткой float64.

In [67]:
columns = univ_df.select_dtypes(include=[np.float64]).columns
univ_df[columns] = univ_df[columns].astype(np.float64)
univ_df[columns]

       NrSiblings
0             3.0
1             0.0
2             4.0
3             1.0
4             0.0
...           ...
30636         2.0
30637         1.0
30638         1.0
30639         3.0
30640         1.0

[30641 rows x 1 columns]

In [68]:
#2. Категориальные переменные пометить меткой category.

In [69]:
columns = univ_df.select_dtypes(include=[object]).columns
univ_df[columns] = univ_df[columns].astype('category')
univ_df[columns]

,Gender,EthnicGroup,ParentEduc,LunchType,TestPrep,ParentMaritalStatus,PracticeSport,IsFirstChild,TransportMeans,WklyStudyHours
0,female,NaN,bachelor's degree,standard,none,married,regularly,yes,school_bus,< 5
1,female,group C,some college,standard,NaN,married,sometimes,yes,NaN,5 - 10
2,female,group B,master's degree,standard,none,single,sometimes,yes,school_bus,< 5
3,male,group A,associate's degree,free/reduced,none,married,never,no,NaN,5 - 10
4,male,group C,some college,standard,none,married,sometimes,yes,school_bus,5 - 10
...,...,...,...,...,...,...,...,...,...,...
30636,female,group D,high school,standard,none,single,sometimes,no,school_bus,5 - 10
30637,male,group E,high school,standard,none,single,regularly,no,private,5 - 10
30638,female,NaN,high school,free/reduced,completed,married,sometimes,no,private,5 - 10
30639,female,group D,associate's degree,standard,completed,married,regularly,no,school_bus,5 - 10
30640,male,group B,some college,standard,none,married,never,no,school_bus,5 - 10

In [70]:
univ_df.dtypes

Unnamed: 0                int64
Gender                 category
EthnicGroup            category
ParentEduc             category
LunchType              category
TestPrep               category
ParentMaritalStatus    category
PracticeSport          category
IsFirstChild           category
NrSiblings              float64
TransportMeans         category
WklyStudyHours         category
MathScore                 int64
ReadingScore              int64
WritingScore              int64
dtype: object

In [71]:
#3. Вывести tail, head набора данных

In [72]:
univ_df.tail()

,Unnamed: 0,Gender,EthnicGroup,ParentEduc,LunchType,TestPrep,ParentMaritalStatus,PracticeSport,IsFirstChild,NrSiblings,TransportMeans,WklyStudyHours,MathScore,ReadingScore,WritingScore
30636,816,female,group D,high school,standard,none,single,sometimes,no,2.0,school_bus,5 - 10,59,61,65
30637,890,male,group E,high school,standard,none,single,regularly,no,1.0,private,5 - 10,58,53,51
30638,911,female,NaN,high school,free/reduced,completed,married,sometimes,no,1.0,private,5 - 10,61,70,67
30639,934,female,group D,associate's degree,standard,completed,married,regularly,no,3.0,school_bus,5 - 10,82,90,93
30640,960,male,group B,some college,standard,none,married,never,no,1.0,school_bus,5 - 10,64,60,58

In [73]:
univ_df.head()

,Unnamed: 0,Gender,EthnicGroup,ParentEduc,LunchType,TestPrep,ParentMaritalStatus,PracticeSport,IsFirstChild,NrSiblings,TransportMeans,WklyStudyHours,MathScore,ReadingScore,WritingScore
0,0,female,NaN,bachelor's degree,standard,none,married,regularly,yes,3.0,school_bus,< 5,71,71,74
1,1,female,group C,some college,standard,NaN,married,sometimes,yes,0.0,NaN,5 - 10,69,90,88
2,2,female,group B,master's degree,standard,none,single,sometimes,yes,4.0,school_bus,< 5,87,93,91
3,3,male,group A,associate's degree,free/reduced,none,married,never,no,1.0,NaN,5 - 10,45,56,42
4,4,male,group C,some college,standard,none,married,sometimes,yes,0.0,school_bus,5 - 10,76,78,75

In [74]:
#4. Вывести df.info

In [75]:
univ_df.info

<bound method DataFrame.info of        Unnamed: 0  Gender EthnicGroup          ParentEduc     LunchType  \
0               0  female         NaN   bachelor's degree      standard
1               1  female     group C        some college      standard
2               2  female     group B     master's degree      standard
3               3    male     group A  associate's degree  free/reduced
4               4    male     group C        some college      standard
...           ...     ...         ...                 ...           ...
30636         816  female     group D         high school      standard
30637         890    male     group E         high school      standard
30638         911  female         NaN         high school  free/reduced
30639         934  female     group D  associate's degree      standard
30640         960    male     group B        some college      standard

        TestPrep ParentMaritalStatus PracticeSport IsFirstChild  NrSiblings  \
0           none             married     regularly          yes         3.0
1            NaN             married     sometimes          yes         0.0
2           none              single     sometimes          yes         4.0
3           none             married         never           no         1.0
4           none             married     sometimes          yes         0.0
...          ...                 ...           ...          ...         ...
30636       none              single     sometimes           no         2.0
30637       none              single     regularly           no         1.0
30638  completed             married     sometimes           no         1.0
30639  completed             married     regularly           no         3.0
30640       none             married         never           no         1.0

      TransportMeans WklyStudyHours  MathScore  ReadingScore  WritingScore
0         school_bus            < 5         71            71            74
1                NaN         5 - 10         69            90            88
2         school_bus            < 5         87            93            91
3                NaN         5 - 10         45            56            42
4         school_bus         5 - 10         76            78            75
...              ...            ...        ...           ...           ...
30636     school_bus         5 - 10         59            61            65
30637        private         5 - 10         58            53            51
30638        private         5 - 10         61            70            67
30639     school_bus         5 - 10         82            90            93
30640     school_bus         5 - 10         64            60            58

[30641 rows x 15 columns]>

In [76]:
#5. Вывести статистические показатели .describe()

In [77]:
univ_df.describe()

         Unnamed: 0    NrSiblings     MathScore  ReadingScore  WritingScore
count  30641.000000  29069.000000  30641.000000  30641.000000  30641.000000
mean     499.556607      2.145894     66.558402     69.377533     68.418622
std      288.747894      1.458242     15.361616     14.758952     15.443525
min        0.000000      0.000000      0.000000     10.000000      4.000000
25%      249.000000      1.000000     56.000000     59.000000     58.000000
50%      500.000000      2.000000     67.000000     70.000000     69.000000
75%      750.000000      3.000000     78.000000     80.000000     79.000000
max      999.000000      7.000000    100.000000    100.000000    100.000000

In [78]:
#3. Выполнить поиск признаков, содержащих NaN, и вычислить их

In [79]:
for column in univ_df.columns.tolist():
    a = univ_df[column].isnull().sum(0)
    if a > 0:
        print(column)
        print("Nan: ", univ_df[column].isnull().sum(0))
        print(univ_df[column].describe())
        print("_______________________________")

EthnicGroup
Nan:  1840
count       28801
unique          5
top       group C
freq         9212
Name: EthnicGroup, dtype: object
_______________________________
ParentEduc
Nan:  1845
count            28796
unique               6
top       some college
freq              6633
Name: ParentEduc, dtype: object
_______________________________
TestPrep
Nan:  1830
count     28811
unique        2
top        none
freq      18856
Name: TestPrep, dtype: object
_______________________________
ParentMaritalStatus
Nan:  1190
count       29451
unique          4
top       married
freq        16844
Name: ParentMaritalStatus, dtype: object
_______________________________
PracticeSport
Nan:  631
count         30010
unique            3
top       sometimes
freq          15213
Name: PracticeSport, dtype: object
_______________________________
IsFirstChild
Nan:  904
count     29737
unique        2
top         yes
freq      19082
Name: IsFirstChild, dtype: object
_______________________________
NrSiblings
Nan:  1572
count    29069.000000
mean         2.145894
std          1.458242
min          0.000000
25%          1.000000
50%          2.000000
75%          3.000000
max          7.000000
Name: NrSiblings, dtype: float64
_______________________________
TransportMeans
Nan:  3134
count          27507
unique             2
top       school_bus
freq           16145
Name: TransportMeans, dtype: object
_______________________________
WklyStudyHours
Nan:  955
count      29686
unique         3
top       5 - 10
freq       16246
Name: WklyStudyHours, dtype: object
_______________________________